In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect("data.db")

In [3]:
cur=sqlite3.Cursor(conn)

In [4]:
conn

In [5]:
cur

In [6]:
cur=conn.cursor()

In [7]:
cur

In [8]:
cur.execute('''
            create table employe(
                id int primary key,
                name varchar not null,
                age int,
                depart varchar
            )
            
            
            
            ''')
conn.commit()

In [9]:
cur.execute('''
            select *from employe
            
            
            
            ''')

conn.commit()

In [15]:
cur.execute('''
            insert into employe(id,name,age,depart) 
            values(696,"reddy",23,"cse")
            
            
            
            ''')

conn.commit()

IntegrityError: UNIQUE constraint failed: employe.id

In [16]:
cur.execute('''
            
            select * from employe
            
            
            ''')
row=cur.fetchall()
for rows in row:
    print(rows)
conn.commit()

(696, 'reddy', 23, 'cse')

In [18]:
cur.execute('''
            insert into employe(id,name,age,depart) 
            values(694,"reddy",23,"cse")
            
            
            
            ''')
cur.execute('''
            insert into employe(id,name,age,depart) 
            values(737,"kiran",22,"ece")
            
            
            
            ''')

conn.commit()

In [19]:
cur.execute('select * from employe')
rows=cur.fetchall()

for row in rows:
    print(row)

(696, 'reddy', 23, 'cse')
(694, 'reddy', 23, 'cse')
(737, 'kiran', 22, 'ece')

In [20]:
cur.execute('''
            update employe
            set age=34
            where(id=694)
            
            
            
            
            ''')
conn.commit()

In [21]:
cur.execute('select * from employe')
rows=cur.fetchall()

for row in rows:
    print(row)

(696, 'reddy', 23, 'cse')
(694, 'reddy', 34, 'cse')
(737, 'kiran', 22, 'ece')

In [22]:
cur.execute('''
            update employe
            set name="hameed"
            where(id=694)
            
            
            
            
            ''')
conn.commit()

In [23]:
cur.execute('select * from employe')
rows=cur.fetchall()

for row in rows:
    print(row)

(696, 'reddy', 23, 'cse')
(694, 'hameed', 34, 'cse')
(737, 'kiran', 22, 'ece')

In [26]:
cur.execute('''
          delete from employe
          where(name="reddy")  
          
          
            
            
            
            ''')

conn.commit()

In [27]:
cur.execute('select * from employe')
rows=cur.fetchall()

for row in rows:
    print(row)

(694, 'hameed', 34, 'cse')
(737, 'kiran', 22, 'ece')

In [28]:
conn=sqlite3.connect("sales.db")

In [29]:
cur=conn.cursor()

In [38]:
cur.execute('''
            
            create table sales1(
                id int primary key,
                date varchar not null,
                product varchar not null,
                sale int ,
                region varchar 
            )
            
            ''')

conn.commit()

In [35]:
cur.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

conn.commit()

In [39]:
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cur.executemany('''
              insert into sales(date,product,sales,region)
              values(?,?,?,?)
                
                
                ''',sales_data)
conn.commit()

In [40]:
cur.execute('''
            select * from sales
            
            
            ''')

rows=cur.fetchall()

for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [41]:
conn.close()

In [43]:
cur.execute('''
            select * from employe
            ''')

ProgrammingError: Cannot operate on a closed database.